replace mermaid with plantuml for C4 diagrams
Signed-off-by: Mohamed Ragab <moragab@gmail.com>
